/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   start_dinner.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yohatana <yohatana@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/13 16:18:42 by yohatana          #+#    #+#             */
/*   Updated: 2025/05/13 16:21:10 by yohatana         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/philo.h"

void	start_dinner()
{
	// すべてのスレッドを待つ
	// dinner_lockみたいな感じ
	// 開始時刻の設定
	// 死ぬか満足したら終わる
}
